#Задание №1

# T = 7
# t = 0
# while T < 100:
#     t += 2
#     T += 1
# print (f'Вода закипит через {t} секунд')




#Задание №2

# T = 7
# t = 0
# while T < 100:
#     t += 2
#     T += 1
# print (f'Вода закипит через {t // 60} мин {t % 60} с')


#Задание №3


# N = int(input('Введите число N: '))
# L = int(input('Введите начало интервала L: '))
# M = int(input('Введите конец интервала M: '))
# while L <= M:
#     print (f'{N} * {L} =', N * L)
#     L += 1



# Задание №5

# i = 0
# while i >= 0:
#     tovar = input('''Выберете товар из списка:
#     1 - хлеб - 100 р
#     2 - молоко - 120 р
#     3 - огурцы - 60 р
#     4 - апельсины - 450 р 
# Для выхода введите EXIT
#     ''')
#     if tovar.upper() == 'EXIT':
#         break
#     elif tovar == '1':
#         i += 100
#     elif tovar == '2':
#         i += 120
#     elif tovar == '3':
#         i += 60
#     elif tovar == '4':
#         i += 450
# print(f'Сумма к оплате: {i}')



#Задача №6

# m = int(input('Введите сумму начального взноса: '))
# s = int(input('Желаемая сумма на счету вклада: '))
# k = int(input('Введите процентную ставку вклада: '))
# i = 0
# while m <= s:
#     i += 1
#     m += m / 100 * k
# print(f'Сумма вклада превысит {s} тыс. руб. через {i} лет') 



#Задача №10

# h = int(input('Введите высоту треугольника: '))
# i = 1
# k = h
# while i <= h*2:
#     print((k-1)*(' '), i*'*')
#     i += 2
#     k -= 1


#Задача №4

# s = '123'
# i = 0
# while i < len(s):
#     if ord(s[i]) >= 48 and ord(s[i]) <= 57:


# s = input('строка: ')
# i = 0
# result = True
# while i < len(s):
#     if not (s[i] >= '0' and s[i] <= '9'): #ASCI
#         result = False
#         break
#     i += 1
# print(result)


#7

"""
Запомним первую букуву, поставим ей соответсвтвие 1, 
читаем следующую букву:
если это так же буква, то 1 +1
иначе: запишем букву и то, что ей соответсвие и запомним новую букву
"""

# s = 'abbccc'
# res = ''
# i = 0
# while i < len(s):
#     ch = s[i]
#     num = 1
#     while i < len(s) - 1 and ch == s[i+1]:
#         num += 1
#         i += 1
#     res += f'{ch}{num}'
#     i += 1
# print (res)


#8





